src/main/resources/wsdl/ptz.wsdl

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
            xmlns:tt="http://www.onvif.org/ver10/schema">
<s:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
               xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
<wsse:UsernameToken>
<wsse:Username>{username}</wsse:Username>
<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">{password}</wsse:Password>
<wsse:Nonce>{nonce}</wsse:Nonce>
<wsu:Created>{created}</wsu:Created>
</wsse:UsernameToken>
</wsse:Security>
</s:Header>
<s:Body>
<tptz:ContinuousMove>
<tptz:ProfileToken>{token}</tptz:ProfileToken>
<tptz:Velocity>
<tt:PanTilt x="{leftRight}" y="{upDown}"/>
<tt:Zoom x="{inOut}"/>
</tptz:Velocity>
</tptz:ContinuousMove>
</s:Body>
</s:Envelope>
